Week4/SOAPPrimeNumberServer/HTTPRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
     soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
     xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
     xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
     xmlns:tns="http://primeNumberServer/"
     xmlns:xsd ="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <tns:isPrimeNumber>
        <tns:arg0>
            10
        </tns:arg0>
    </tns:isPrimeNumber>
  </soap:Body>
</soap:Envelope>